### DataFrame_Pandas

### Boolean

In [98]:
True == False

False

In [102]:
True !=0

True

In [103]:
False == 0

True

In [99]:
True or False

True

In [101]:
1 =='1'

False

In [4]:
e='Abcde'

In [11]:
big=e.upper()

big

'ABCDE'

In [8]:
e.lower()

'abcde'

In [13]:
print(big)

ABCDE

In [69]:
data = ['재홍','유빈',2,3,4]
t=(1,2,3,4,5)
d={'name':'일',2:'이'}

In [73]:
d.keys()

dict_keys(['name', 2])

In [74]:
d.values()

dict_values(['일', '이'])

In [72]:
d['name']

'일'

In [62]:
t[0]='일' #튜플의 요소는 기본적으로 바꿀수 없다

TypeError: 'tuple' object does not support item assignment

In [48]:
data[1],data[4]

('유빈', 4)

In [50]:
data[2:]

[2, 3, 4]

In [51]:
data[:2]

['재홍', '유빈']

In [54]:
data[0]='석찬'

In [55]:
data[0]

'석찬'

In [25]:
type(data)

list

In [20]:
data.append('java')

In [21]:
data[0],data[-1],data[1:],data[:2]

('java', 'java', [], ['java'])

In [22]:
data.sort()

In [23]:
data.reverse()

In [76]:
a=[1,2,3]
b=['치킨','피자','고구마']

In [89]:
a.append(400)

In [78]:
b

['치킨', '피자', '고구마']

In [91]:
s1=[a,b]

In [92]:
s1

[[1, 2, 3, 400], ['치킨', '피자', '고구마']]

In [226]:
import pandas as pd

In [227]:
pd.Series(s1)

0    [1, 2, 3, 400]
1     [치킨, 피자, 고구마]
dtype: object

In [228]:
pd.DataFrame(s1)

    0   1    2      3
0   1   2    3  400.0
1  치킨  피자  고구마    NaN

In [253]:
pre=[
    {'이름':'은주','나이':30,'직업':'j1'}
    {'이름':'소주','나이':20,'직업':'j2'}
    {'이름':'대주','나이':10,'직업':'j3'}
    {'이름':'국주','나이':40,'직업':'j1'}
]

SyntaxError: invalid syntax (<ipython-input-253-9f4e3b218095>, line 3)

In [252]:
pd.DataFrame(pre)

   이름  나이  직업
0  국주  40  j1

In [249]:
per_2 = {
    '이름': ['은주','소주','은주','은주'],
    '나이': [30,40,10,21],
    '직업': ['j1','j1','j1','j1']
}

In [269]:
pd.DataFrame(per_2)

   이름  나이  직업
0  은주  30  j1
1  소주  40  j1
2  은주  10  j1
3  은주  21  j1

In [271]:
p =[
    ['a',100,80],['b',17,60],['b',50,40],['d',90,80]
]

In [273]:
col_name=('name','국어','영어')

In [277]:
df=pd.DataFrame.from_records(p,columns=col_name, index=[1,2,3,4])

In [278]:
df[['국어','영어']]>70

      국어     영어
1   True   True
2  False  False
3  False  False
4   True   True

In [289]:
um ={
    '3식' :['아침','점심','저녁'],
    '메뉴' :['삼겹살','치킨','피자']
}
df=pd.DataFrame

In [290]:
pd.DataFrame(um)

   3식   메뉴
0  아침  삼겹살
1  점심   치킨
2  저녁   피자

In [267]:
joon ={
    '학번' :[30102,30201,30303,30501],
    'java' :[1,2,3,4],
    'Python' :[1,2,3,4],
    'c' :[1,2,3,4]
}

In [268]:
pd.DataFrame(joon)

      학번  java  Python  c
0  30102     1       1  1
1  30201     2       2  2
2  30303     3       3  3
3  30501     4       4  4